<?php

use Illuminate\Database\Seeder;

class UnitsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $incrementalUnits = [
          [
              'title' => 'مدیریت نیروی اسنانی دفتر تهران',
              'code' => 1,
          ],
          [
              'title' => 'مسئول واحد تامین و خرید دفتر تهران',
              'code' => 2,
          ],
          [
              'title' => 'دفتر مع نیروی انسانی ندسا مستقر در دفتر تهران',
              'code' => 3,
          ],
          [
              'title' => 'دفتر مع فرهنگی و عملیات روانی ندسا مستقر در دفتر تهران',
              'code' => 4,
          ],
          [
              'title' => 'دفتر مع علیات ندسا مستقر در دفتر تهران',
              'code' => 5,
          ],
          [
              'title' => 'دفتر مع ط.ب.ب و مالی مستقر در دفتر تهران ندسا',
              'code' => 6,
          ],
          [
              'title' => 'دفتر مع حقوقی ندسا مستقر در دفتر تهران',
              'code' => 7,
          ],
          [
              'title' => 'دفتر معاونت بازرسی مستقر در دفتر تهران',
              'code' => 8,
          ],
          [
              'title' => 'دفتر مع اطلاعات ندسا مستقر در دفتر تهران',
              'code' => 9,
          ],
          [
              'title' => 'دفتر مع آموزشی ندسا مستقر در دفتر تهران',
              'code' => 10,
          ],
          [
              'title' => 'دفتر معاونت آماد ندسا مستقر در دفتر تهران',
              'code' => 12,
          ],
          [
              'title' => 'مسئول دفتر فرماندهی دفتر تهران ندسا',
              'code' => 13,
          ],
          [
              'title' => 'مرکز گزینش و عضویابی ندسا',
              'code' => 14,
          ],
          [
              'title' => 'حوزه نمایندگی ولی فقیه ندسا مستقر در دفتر تهران',
              'code' => 15,
          ],
            [
                'title' => 'مسئول معاونت مهندسی ندسا مستقر در دفتر تهران',
                'code' => 16,
            ],
            [
                'title' => 'دفتر مع فاوا ندسا مستقر در دفتر تهران',
                'code' => 18,
            ],
            [
                'title' => 'ارشد دفتر فرماندهی ندسا مستقر در دفتر تهران',
                'code' => 19,
            ],
            [
                'title' => 'نماینده مع دانش و پژوهش مستقر د دفتر تهران',
                'code' => 20,
            ],
            [
                'title' => 'حفا دفتر تهران ندسا',
                'code' => 21,
            ],
            [
                'title' => 'نماینده مع تربیت بدنی ندسا مستقر در دفتر تهران',
                'code' => 22,
            ],
            [
                'title' => 'مسئول دفتر دانشگاه دریایی امام خامنه ای',
                'code' => 23,
            ],
            [
                'title' => 'ف بهداری ندسا مستقر در دفتر تهران و درمانگاه',
                'code' => 25,
            ],
            [
                'title' => 'دفتر نمایندگی کانون بازنشستگی دفتر تهران ندسا',
                'code' => 26,
            ],
            [
                'title' => 'دفتر مرکز خدمات رفاه ندسا مستقر در دفتر تهران',
                'code' => 29,
            ],
            [
                'title' => 'مهمانسرای الغدیر ندسا',
                'code' => 30,
            ],
            [
                'title' => 'مسئول مالی، طرح و برنامه دفتر تهران ندسا',
                'code' => 31,
            ],
            [
                'title' => 'فرماندهی قرارگاه پش دفتر تهران ندسا معرفی به دژبان',
                'code' => 32,
            ],
            [
                'title' => 'موقعیت شهید بیژن گرد ندسا',
                'code' => 35,
            ],
            [
                'title' => 'نماینده فرماندهی گهباد مستقر در دفتر تهران',
                'code' => 39,
            ],
            [
                'title' => 'واحد آماد دفتر تهران ندسا - آشپزخانه',
                'code' => 40,
            ],
            [
                'title' => 'واحد تاسیسات و تعمیرات دفتر تهران ندسا',
                'code' => 43,
            ],
            [
                'title' => 'فرماندهی قرارگاه پش دفتر تهران ندسا - ترابری',
                'code' => 44,
            ],
            [
                'title' => 'فرماندهی قرارگاه پش دفتر تهران ندسا - آرایشگاه',
                'code' => 45,
            ],
            [
                'title' => 'فرماندهی قرارگاه پش دفتر تهران ندسا - خدمات و اداری',
                'code' => 46,
            ],
            [
                'title' => 'فرماندهی قرارگاه پش دفتر تهران ندس - خشکشویی',
                'code' => 47,
            ],
            [
                'title' => 'مع جنگال ندسا مستقر در دفتر تهران',
                'code' => 51,
            ],
            [
                'title' => 'مدیریت شهرک بهمن ندسا',
                'code' => 54,
            ],
            [
                'title' => 'مسئول بیت الزهرا دفتر تهران ندسا',
                'code' => 55,
            ],
        ];

        $units = [
            [
                'title' => 'گنجینه دریایی دفاع مقدس ندسا',
                'code' => 2068
            ],
            [
                'title' => 'گنجینه دریایی دفاع مقدس ندسا',
                'code' => 2069
            ],
        ];

        foreach ($incrementalUnits as $incrementalUnit) {
            \App\Models\Unit::create([
                'title' => $incrementalUnit['title'],
                'code' => $incrementalUnit['code']
            ]);
        }

        foreach ($units as $unit) {
            \App\Models\Unit::create([
                'title' => $unit['title'],
                'code' => $unit['code'],
            ]);
        }
    }
}
